Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_hrtim_common.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32H747_CM7_hrtim_common.
; ===========================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32H747_CM7_hrtim_common equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// HRTIM_COMMON address definitions
// --------------------------------

typedef struct {
    volatile    uint32_t    CR1;
    volatile    uint32_t    CR2;
    volatile    uint32_t    ISR;
    volatile    uint32_t    ICR;
    volatile    uint32_t    IER;
    volatile    uint32_t    OENR;
    volatile    uint32_t    DISR;
    volatile    uint32_t    ODSR;
    volatile    uint32_t    BMCR;
    volatile    uint32_t    BMTRG;
    volatile    uint32_t    BMCMPR6;
    volatile    uint32_t    BMPER;
    volatile    uint32_t    EECR1;
    volatile    uint32_t    EECR2;
    volatile    uint32_t    EECR3;
    volatile    uint32_t    ADC1R;
    volatile    uint32_t    ADC2R;
    volatile    uint32_t    ADC3R;
    volatile    uint32_t    ADC4R;
    volatile    uint32_t    DLLCR;
    volatile    uint32_t    FLTINR1;
    volatile    uint32_t    FLTINR2;
    volatile    uint32_t    BDMUPDR;
    volatile    uint32_t    BDTXUPR;
    volatile    uint32_t    BDMADR;
} HRTIM_COMMON_TypeDef;

#ifdef __cplusplus
#define HRTIM_COMMON    reinterpret_cast<HRTIM_COMMON_TypeDef *>(0x40017780U)

#else
#define HRTIM_COMMON    ((HRTIM_COMMON_TypeDef *)0x40017780U)
#endif

// CR1 Configuration

#define HRTIM_COMMON_CR1_MUDIS          (0x1U<<0)
#define HRTIM_COMMON_CR1_TAUDIS         (0x1U<<1)
#define HRTIM_COMMON_CR1_TBUDIS         (0x1U<<2)
#define HRTIM_COMMON_CR1_TCUDIS         (0x1U<<3)
#define HRTIM_COMMON_CR1_TDUDIS         (0x1U<<4)
#define HRTIM_COMMON_CR1_TEUDIS         (0x1U<<5)
#define HRTIM_COMMON_CR1_AD1USRC        (0x7U<<16)
#define HRTIM_COMMON_CR1_AD1USRC_0      (0x1U<<16)
#define HRTIM_COMMON_CR1_AD2USRC        (0x7U<<19)
#define HRTIM_COMMON_CR1_AD2USRC_0      (0x1U<<19)
#define HRTIM_COMMON_CR1_AD3USRC        (0x7U<<22)
#define HRTIM_COMMON_CR1_AD3USRC_0      (0x1U<<22)
#define HRTIM_COMMON_CR1_AD4USRC        (0x7U<<25)
#define HRTIM_COMMON_CR1_AD4USRC_0      (0x1U<<25)

// CR2 Configuration

#define HRTIM_COMMON_CR2_MSWU           (0x1U<<0)
#define HRTIM_COMMON_CR2_TASWU          (0x1U<<1)
#define HRTIM_COMMON_CR2_TBSWU          (0x1U<<2)
#define HRTIM_COMMON_CR2_TCSWU          (0x1U<<3)
#define HRTIM_COMMON_CR2_TDSWU          (0x1U<<4)
#define HRTIM_COMMON_CR2_TESWU          (0x1U<<5)
#define HRTIM_COMMON_CR2_MRST           (0x1U<<8)
#define HRTIM_COMMON_CR2_TARST          (0x1U<<9)
#define HRTIM_COMMON_CR2_TBRST          (0x1U<<10)
#define HRTIM_COMMON_CR2_TCRST          (0x1U<<11)
#define HRTIM_COMMON_CR2_TDRST          (0x1U<<12)
#define HRTIM_COMMON_CR2_TERST          (0x1U<<13)

// ISR Configuration

#define HRTIM_COMMON_ISR_FLT1           (0x1U<<0)
#define HRTIM_COMMON_ISR_FLT2           (0x1U<<1)
#define HRTIM_COMMON_ISR_FLT3           (0x1U<<2)
#define HRTIM_COMMON_ISR_FLT4           (0x1U<<3)
#define HRTIM_COMMON_ISR_FLT5           (0x1U<<4)
#define HRTIM_COMMON_ISR_SYSFLT         (0x1U<<5)
#define HRTIM_COMMON_ISR_DLLRDY         (0x1U<<16)
#define HRTIM_COMMON_ISR_BMPER          (0x1U<<17)

// ICR Configuration

#define HRTIM_COMMON_ICR_FLT1C          (0x1U<<0)
#define HRTIM_COMMON_ICR_FLT2C          (0x1U<<1)
#define HRTIM_COMMON_ICR_FLT3C          (0x1U<<2)
#define HRTIM_COMMON_ICR_FLT4C          (0x1U<<3)
#define HRTIM_COMMON_ICR_FLT5C          (0x1U<<4)
#define HRTIM_COMMON_ICR_SYSFLTC        (0x1U<<5)
#define HRTIM_COMMON_ICR_DLLRDYC        (0x1U<<16)
#define HRTIM_COMMON_ICR_BMPERC         (0x1U<<17)

// IER Configuration

#define HRTIM_COMMON_IER_FLT1IE         (0x1U<<0)
#define HRTIM_COMMON_IER_FLT2IE         (0x1U<<1)
#define HRTIM_COMMON_IER_FLT3IE         (0x1U<<2)
#define HRTIM_COMMON_IER_FLT4IE         (0x1U<<3)
#define HRTIM_COMMON_IER_FLT5IE         (0x1U<<4)
#define HRTIM_COMMON_IER_SYSFLTE        (0x1U<<5)
#define HRTIM_COMMON_IER_DLLRDYIE       (0x1U<<16)
#define HRTIM_COMMON_IER_BMPERIE        (0x1U<<17)

// OENR Configuration

#define HRTIM_COMMON_OENR_TA1OEN        (0x1U<<0)
#define HRTIM_COMMON_OENR_TA2OEN        (0x1U<<1)
#define HRTIM_COMMON_OENR_TB1OEN        (0x1U<<2)
#define HRTIM_COMMON_OENR_TB2OEN        (0x1U<<3)
#define HRTIM_COMMON_OENR_TC1OEN        (0x1U<<4)
#define HRTIM_COMMON_OENR_TC2OEN        (0x1U<<5)
#define HRTIM_COMMON_OENR_TD1OEN        (0x1U<<6)
#define HRTIM_COMMON_OENR_TD2OEN        (0x1U<<7)
#define HRTIM_COMMON_OENR_TE1OEN        (0x1U<<8)
#define HRTIM_COMMON_OENR_TE2OEN        (0x1U<<9)

// DISR Configuration

#define HRTIM_COMMON_DISR_TA1ODIS       (0x1U<<0)
#define HRTIM_COMMON_DISR_TA2ODIS       (0x1U<<1)
#define HRTIM_COMMON_DISR_TB1ODIS       (0x1U<<2)
#define HRTIM_COMMON_DISR_TB2ODIS       (0x1U<<3)
#define HRTIM_COMMON_DISR_TC1ODIS       (0x1U<<4)
#define HRTIM_COMMON_DISR_TC2ODIS       (0x1U<<5)
#define HRTIM_COMMON_DISR_TD1ODIS       (0x1U<<6)
#define HRTIM_COMMON_DISR_TD2ODIS       (0x1U<<7)
#define HRTIM_COMMON_DISR_TE1ODIS       (0x1U<<8)
#define HRTIM_COMMON_DISR_TE2ODIS       (0x1U<<9)

// ODSR Configuration

#define HRTIM_COMMON_ODSR_TA1ODS        (0x1U<<0)
#define HRTIM_COMMON_ODSR_TA2ODS        (0x1U<<1)
#define HRTIM_COMMON_ODSR_TB1ODS        (0x1U<<2)
#define HRTIM_COMMON_ODSR_TB2ODS        (0x1U<<3)
#define HRTIM_COMMON_ODSR_TC1ODS        (0x1U<<4)
#define HRTIM_COMMON_ODSR_TC2ODS        (0x1U<<5)
#define HRTIM_COMMON_ODSR_TD1ODS        (0x1U<<6)
#define HRTIM_COMMON_ODSR_TD2ODS        (0x1U<<7)
#define HRTIM_COMMON_ODSR_TE1ODS        (0x1U<<8)
#define HRTIM_COMMON_ODSR_TE2ODS        (0x1U<<9)

// BMCR Configuration

