Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_hrtim_common.h
#define HRTIM_COMMON_BMCR_BME           (0x1U<<0)
#define HRTIM_COMMON_BMCR_BMOM          (0x1U<<1)
#define HRTIM_COMMON_BMCR_BMCLK         (0xFU<<2)
#define HRTIM_COMMON_BMCR_BMCLK_0       (0x1U<<2)
#define HRTIM_COMMON_BMCR_BMPRSC        (0xFU<<6)
#define HRTIM_COMMON_BMCR_BMPRSC_0      (0x1U<<6)
#define HRTIM_COMMON_BMCR_BMPREN        (0x1U<<10)
#define HRTIM_COMMON_BMCR_MTBM          (0x1U<<16)
#define HRTIM_COMMON_BMCR_TABM          (0x1U<<17)
#define HRTIM_COMMON_BMCR_TBBM          (0x1U<<18)
#define HRTIM_COMMON_BMCR_TCBM          (0x1U<<19)
#define HRTIM_COMMON_BMCR_TDBM          (0x1U<<20)
#define HRTIM_COMMON_BMCR_TEBM          (0x1U<<21)
#define HRTIM_COMMON_BMCR_BMSTAT        (0x1U<<31)

// BMTRG Configuration

#define HRTIM_COMMON_BMTRG_SW           (0x1U<<0)
#define HRTIM_COMMON_BMTRG_MSTRST       (0x1U<<1)
#define HRTIM_COMMON_BMTRG_MSTREP       (0x1U<<2)
#define HRTIM_COMMON_BMTRG_MSTCMP1      (0x1U<<3)
#define HRTIM_COMMON_BMTRG_MSTCMP2      (0x1U<<4)
#define HRTIM_COMMON_BMTRG_MSTCMP3      (0x1U<<5)
#define HRTIM_COMMON_BMTRG_MSTCMP4      (0x1U<<6)
#define HRTIM_COMMON_BMTRG_TARST        (0x1U<<7)
#define HRTIM_COMMON_BMTRG_TAREP        (0x1U<<8)
#define HRTIM_COMMON_BMTRG_TACMP1       (0x1U<<9)
#define HRTIM_COMMON_BMTRG_TACMP2       (0x1U<<10)
#define HRTIM_COMMON_BMTRG_TBRST        (0x1U<<11)
#define HRTIM_COMMON_BMTRG_TBREP        (0x1U<<12)
#define HRTIM_COMMON_BMTRG_TBCMP1       (0x1U<<13)
#define HRTIM_COMMON_BMTRG_TBCMP2       (0x1U<<14)
#define HRTIM_COMMON_BMTRG_TCRST        (0x1U<<15)
#define HRTIM_COMMON_BMTRG_TCREP        (0x1U<<16)
#define HRTIM_COMMON_BMTRG_TCCMP1       (0x1U<<17)
#define HRTIM_COMMON_BMTRG_TCCMP2       (0x1U<<18)
#define HRTIM_COMMON_BMTRG_TDRST        (0x1U<<19)
#define HRTIM_COMMON_BMTRG_TDREP        (0x1U<<20)
#define HRTIM_COMMON_BMTRG_TDCMP1       (0x1U<<21)
#define HRTIM_COMMON_BMTRG_TDCMP2       (0x1U<<22)
#define HRTIM_COMMON_BMTRG_TERST        (0x1U<<23)
#define HRTIM_COMMON_BMTRG_TEREP        (0x1U<<24)
#define HRTIM_COMMON_BMTRG_TECMP1       (0x1U<<25)
#define HRTIM_COMMON_BMTRG_TECMP2       (0x1U<<26)
#define HRTIM_COMMON_BMTRG_OCHPEV       (0x1U<<31)

// BMCMPR6 Configuration

#define HRTIM_COMMON_BMCMPR6_BMCMP      (0xFFFFU<<0)
#define HRTIM_COMMON_BMCMPR6_BMCMP_0    (0x1U<<0)

// BMPER Configuration

#define HRTIM_COMMON_BMPER_BMPER        (0xFFFFU<<0)
#define HRTIM_COMMON_BMPER_BMPER_0      (0x1U<<0)

// EECR1 Configuration

#define HRTIM_COMMON_EECR1_EE1SRC       (0x3U<<0)
#define HRTIM_COMMON_EECR1_EE1SRC_0     (0x1U<<0)
#define HRTIM_COMMON_EECR1_EE1POL       (0x1U<<2)
#define HRTIM_COMMON_EECR1_EE1SNS       (0x3U<<3)
#define HRTIM_COMMON_EECR1_EE1SNS_0     (0x1U<<3)
#define HRTIM_COMMON_EECR1_EE1FAST      (0x1U<<5)
#define HRTIM_COMMON_EECR1_EE2SRC       (0x3U<<6)
#define HRTIM_COMMON_EECR1_EE2SRC_0     (0x1U<<6)
#define HRTIM_COMMON_EECR1_EE2POL       (0x1U<<8)
#define HRTIM_COMMON_EECR1_EE2SNS       (0x3U<<9)
#define HRTIM_COMMON_EECR1_EE2SNS_0     (0x1U<<9)
#define HRTIM_COMMON_EECR1_EE2FAST      (0x1U<<11)
#define HRTIM_COMMON_EECR1_EE3SRC       (0x3U<<12)
#define HRTIM_COMMON_EECR1_EE3SRC_0     (0x1U<<12)
#define HRTIM_COMMON_EECR1_EE3POL       (0x1U<<14)
#define HRTIM_COMMON_EECR1_EE3SNS       (0x3U<<15)
#define HRTIM_COMMON_EECR1_EE3SNS_0     (0x1U<<15)
#define HRTIM_COMMON_EECR1_EE3FAST      (0x1U<<17)
#define HRTIM_COMMON_EECR1_EE4SRC       (0x3U<<18)
#define HRTIM_COMMON_EECR1_EE4SRC_0     (0x1U<<18)
#define HRTIM_COMMON_EECR1_EE4POL       (0x1U<<20)
#define HRTIM_COMMON_EECR1_EE4SNS       (0x3U<<21)
#define HRTIM_COMMON_EECR1_EE4SNS_0     (0x1U<<21)
#define HRTIM_COMMON_EECR1_EE4FAST      (0x1U<<23)
#define HRTIM_COMMON_EECR1_EE5SRC       (0x3U<<24)
#define HRTIM_COMMON_EECR1_EE5SRC_0     (0x1U<<24)
#define HRTIM_COMMON_EECR1_EE5POL       (0x1U<<26)
#define HRTIM_COMMON_EECR1_EE5SNS       (0x3U<<27)
#define HRTIM_COMMON_EECR1_EE5SNS_0     (0x1U<<27)
#define HRTIM_COMMON_EECR1_EE5FAST      (0x1U<<29)

// EECR2 Configuration

#define HRTIM_COMMON_EECR2_EE6SRC       (0x3U<<0)
#define HRTIM_COMMON_EECR2_EE6SRC_0     (0x1U<<0)
#define HRTIM_COMMON_EECR2_EE6POL       (0x1U<<2)
#define HRTIM_COMMON_EECR2_EE6SNS       (0x3U<<3)
#define HRTIM_COMMON_EECR2_EE6SNS_0     (0x1U<<3)
#define HRTIM_COMMON_EECR2_EE7SRC       (0x3U<<6)
#define HRTIM_COMMON_EECR2_EE7SRC_0     (0x1U<<6)
#define HRTIM_COMMON_EECR2_EE7POL       (0x1U<<8)
#define HRTIM_COMMON_EECR2_EE7SNS       (0x3U<<9)
#define HRTIM_COMMON_EECR2_EE7SNS_0     (0x1U<<9)
#define HRTIM_COMMON_EECR2_EE8SRC       (0x3U<<12)
#define HRTIM_COMMON_EECR2_EE8SRC_0     (0x1U<<12)
#define HRTIM_COMMON_EECR2_EE8POL       (0x1U<<14)
#define HRTIM_COMMON_EECR2_EE8SNS       (0x3U<<15)
#define HRTIM_COMMON_EECR2_EE8SNS_0     (0x1U<<15)
#define HRTIM_COMMON_EECR2_EE9SRC       (0x3U<<18)
#define HRTIM_COMMON_EECR2_EE9SRC_0     (0x1U<<18)
#define HRTIM_COMMON_EECR2_EE9POL       (0x1U<<20)
#define HRTIM_COMMON_EECR2_EE9SNS       (0x3U<<21)
#define HRTIM_COMMON_EECR2_EE9SNS_0     (0x1U<<21)
#define HRTIM_COMMON_EECR2_EE10SRC      (0x3U<<24)
#define HRTIM_COMMON_EECR2_EE10SRC_0    (0x1U<<24)
#define HRTIM_COMMON_EECR2_EE10POL      (0x1U<<26)
#define HRTIM_COMMON_EECR2_EE10SNS      (0x3U<<27)
#define HRTIM_COMMON_EECR2_EE10SNS_0    (0x1U<<27)

// EECR3 Configuration

#define HRTIM_COMMON_EECR3_EE6SRC       (0x3U<<0)
#define HRTIM_COMMON_EECR3_EE6SRC_0     (0x1U<<0)
#define HRTIM_COMMON_EECR3_EE6POL       (0x1U<<2)
#define HRTIM_COMMON_EECR3_EE6SNS       (0x3U<<3)
#define HRTIM_COMMON_EECR3_EE6SNS_0     (0x1U<<3)
#define HRTIM_COMMON_EECR3_EE7SRC       (0x3U<<6)
#define HRTIM_COMMON_EECR3_EE7SRC_0     (0x1U<<6)
#define HRTIM_COMMON_EECR3_EE7POL       (0x1U<<8)
#define HRTIM_COMMON_EECR3_EE7SNS       (0x3U<<9)
#define HRTIM_COMMON_EECR3_EE7SNS_0     (0x1U<<9)
#define HRTIM_COMMON_EECR3_EE8SRC       (0x3U<<12)
#define HRTIM_COMMON_EECR3_EE8SRC_0     (0x1U<<12)
#define HRTIM_COMMON_EECR3_EE8POL       (0x1U<<14)
#define HRTIM_COMMON_EECR3_EE8SNS       (0x3U<<15)
#define HRTIM_COMMON_EECR3_EE8SNS_0     (0x1U<<15)
#define HRTIM_COMMON_EECR3_EE9SRC       (0x3U<<18)
#define HRTIM_COMMON_EECR3_EE9SRC_0     (0x1U<<18)
#define HRTIM_COMMON_EECR3_EE9POL       (0x1U<<20)
#define HRTIM_COMMON_EECR3_EE9SNS       (0x3U<<21)
#define HRTIM_COMMON_EECR3_EE9SNS_0     (0x1U<<21)
#define HRTIM_COMMON_EECR3_EE10SRC      (0x3U<<24)
#define HRTIM_COMMON_EECR3_EE10SRC_0    (0x1U<<24)
#define HRTIM_COMMON_EECR3_EE10POL      (0x1U<<26)
#define HRTIM_COMMON_EECR3_EE10SNS      (0x3U<<27)
#define HRTIM_COMMON_EECR3_EE10SNS_0    (0x1U<<27)

// ADC1R Configuration

#define HRTIM_COMMON_ADC1R_AD1MC1       (0x1U<<0)
#define HRTIM_COMMON_ADC1R_AD1MC2       (0x1U<<1)
#define HRTIM_COMMON_ADC1R_AD1MC3       (0x1U<<2)
#define HRTIM_COMMON_ADC1R_AD1MC4       (0x1U<<3)
#define HRTIM_COMMON_ADC1R_AD1MPER      (0x1U<<4)
#define HRTIM_COMMON_ADC1R_AD1EEV1      (0x1U<<5)
#define HRTIM_COMMON_ADC1R_AD1EEV2      (0x1U<<6)
#define HRTIM_COMMON_ADC1R_AD1EEV3      (0x1U<<7)
#define HRTIM_COMMON_ADC1R_AD1EEV4      (0x1U<<8)
#define HRTIM_COMMON_ADC1R_AD1EEV5      (0x1U<<9)
#define HRTIM_COMMON_ADC1R_AD1TAC2      (0x1U<<10)
#define HRTIM_COMMON_ADC1R_AD1TAC3      (0x1U<<11)
#define HRTIM_COMMON_ADC1R_AD1TAC4      (0x1U<<12)
#define HRTIM_COMMON_ADC1R_AD1TAPER     (0x1U<<13)
#define HRTIM_COMMON_ADC1R_AD1TARST     (0x1U<<14)
#define HRTIM_COMMON_ADC1R_AD1TBC2      (0x1U<<15)
#define HRTIM_COMMON_ADC1R_AD1TBC3      (0x1U<<16)
#define HRTIM_COMMON_ADC1R_AD1TBC4      (0x1U<<17)
#define HRTIM_COMMON_ADC1R_AD1TBPER     (0x1U<<18)
#define HRTIM_COMMON_ADC1R_AD1TBRST     (0x1U<<19)
#define HRTIM_COMMON_ADC1R_AD1TCC2      (0x1U<<20)
#define HRTIM_COMMON_ADC1R_AD1TCC3      (0x1U<<21)
#define HRTIM_COMMON_ADC1R_AD1TCC4      (0x1U<<22)
#define HRTIM_COMMON_ADC1R_AD1TCPER     (0x1U<<23)
#define HRTIM_COMMON_ADC1R_AD1TDC2      (0x1U<<24)
#define HRTIM_COMMON_ADC1R_AD1TDC3      (0x1U<<25)
#define HRTIM_COMMON_ADC1R_AD1TDC4      (0x1U<<26)
#define HRTIM_COMMON_ADC1R_AD1TDPER     (0x1U<<27)
#define HRTIM_COMMON_ADC1R_AD1TEC2      (0x1U<<28)
#define HRTIM_COMMON_ADC1R_AD1TEC3      (0x1U<<29)
#define HRTIM_COMMON_ADC1R_AD1TEC4      (0x1U<<30)
#define HRTIM_COMMON_ADC1R_AD1TEPER     (0x1U<<31)

// ADC2R Configuration

#define HRTIM_COMMON_ADC2R_AD2MC1       (0x1U<<0)
#define HRTIM_COMMON_ADC2R_AD2MC2       (0x1U<<1)
#define HRTIM_COMMON_ADC2R_AD2MC3       (0x1U<<2)
#define HRTIM_COMMON_ADC2R_AD2MC4       (0x1U<<3)
#define HRTIM_COMMON_ADC2R_AD2MPER      (0x1U<<4)
#define HRTIM_COMMON_ADC2R_AD2EEV6      (0x1U<<5)
#define HRTIM_COMMON_ADC2R_AD2EEV7      (0x1U<<6)
#define HRTIM_COMMON_ADC2R_AD2EEV8      (0x1U<<7)
#define HRTIM_COMMON_ADC2R_AD2EEV9      (0x1U<<8)
#define HRTIM_COMMON_ADC2R_AD2EEV10     (0x1U<<9)
#define HRTIM_COMMON_ADC2R_AD2TAC2      (0x1U<<10)
#define HRTIM_COMMON_ADC2R_AD2TAC3      (0x1U<<11)
#define HRTIM_COMMON_ADC2R_AD2TAC4      (0x1U<<12)
#define HRTIM_COMMON_ADC2R_AD2TAPER     (0x1U<<13)
#define HRTIM_COMMON_ADC2R_AD2TBC2      (0x1U<<14)
#define HRTIM_COMMON_ADC2R_AD2TBC3      (0x1U<<15)
#define HRTIM_COMMON_ADC2R_AD2TBC4      (0x1U<<16)
#define HRTIM_COMMON_ADC2R_AD2TBPER     (0x1U<<17)
#define HRTIM_COMMON_ADC2R_AD2TCC2      (0x1U<<18)
#define HRTIM_COMMON_ADC2R_AD2TCC3      (0x1U<<19)
#define HRTIM_COMMON_ADC2R_AD2TCC4      (0x1U<<20)
#define HRTIM_COMMON_ADC2R_AD2TCPER     (0x1U<<21)
#define HRTIM_COMMON_ADC2R_AD2TCRST     (0x1U<<22)
#define HRTIM_COMMON_ADC2R_AD2TDC2      (0x1U<<23)
#define HRTIM_COMMON_ADC2R_AD2TDC3      (0x1U<<24)
#define HRTIM_COMMON_ADC2R_AD2TDC4      (0x1U<<25)
#define HRTIM_COMMON_ADC2R_AD2TDPER     (0x1U<<26)
#define HRTIM_COMMON_ADC2R_AD2TDRST     (0x1U<<27)
#define HRTIM_COMMON_ADC2R_AD2TEC2      (0x1U<<28)
#define HRTIM_COMMON_ADC2R_AD2TEC3      (0x1U<<29)
#define HRTIM_COMMON_ADC2R_AD2TEC4      (0x1U<<30)
#define HRTIM_COMMON_ADC2R_AD2TERST     (0x1U<<31)

// ADC3R Configuration

#define HRTIM_COMMON_ADC3R_AD1MC1       (0x1U<<0)
#define HRTIM_COMMON_ADC3R_AD1MC2       (0x1U<<1)
#define HRTIM_COMMON_ADC3R_AD1MC3       (0x1U<<2)
#define HRTIM_COMMON_ADC3R_AD1MC4       (0x1U<<3)
#define HRTIM_COMMON_ADC3R_AD1MPER      (0x1U<<4)
#define HRTIM_COMMON_ADC3R_AD1EEV1      (0x1U<<5)
#define HRTIM_COMMON_ADC3R_AD1EEV2      (0x1U<<6)
#define HRTIM_COMMON_ADC3R_AD1EEV3      (0x1U<<7)
#define HRTIM_COMMON_ADC3R_AD1EEV4      (0x1U<<8)
#define HRTIM_COMMON_ADC3R_AD1EEV5      (0x1U<<9)
#define HRTIM_COMMON_ADC3R_AD1TAC2      (0x1U<<10)
#define HRTIM_COMMON_ADC3R_AD1TAC3      (0x1U<<11)
#define HRTIM_COMMON_ADC3R_AD1TAC4      (0x1U<<12)
#define HRTIM_COMMON_ADC3R_AD1TAPER     (0x1U<<13)
#define HRTIM_COMMON_ADC3R_AD1TARST     (0x1U<<14)
#define HRTIM_COMMON_ADC3R_AD1TBC2      (0x1U<<15)
#define HRTIM_COMMON_ADC3R_AD1TBC3      (0x1U<<16)
#define HRTIM_COMMON_ADC3R_AD1TBC4      (0x1U<<17)
#define HRTIM_COMMON_ADC3R_AD1TBPER     (0x1U<<18)
#define HRTIM_COMMON_ADC3R_AD1TBRST     (0x1U<<19)
#define HRTIM_COMMON_ADC3R_AD1TCC2      (0x1U<<20)
#define HRTIM_COMMON_ADC3R_AD1TCC3      (0x1U<<21)
#define HRTIM_COMMON_ADC3R_AD1TCC4      (0x1U<<22)
#define HRTIM_COMMON_ADC3R_AD1TCPER     (0x1U<<23)
#define HRTIM_COMMON_ADC3R_AD1TDC2      (0x1U<<24)
#define HRTIM_COMMON_ADC3R_AD1TDC3      (0x1U<<25)
#define HRTIM_COMMON_ADC3R_AD1TDC4      (0x1U<<26)
#define HRTIM_COMMON_ADC3R_AD1TDPER     (0x1U<<27)
#define HRTIM_COMMON_ADC3R_AD1TEC2      (0x1U<<28)
#define HRTIM_COMMON_ADC3R_AD1TEC3      (0x1U<<29)
#define HRTIM_COMMON_ADC3R_AD1TEC4      (0x1U<<30)
#define HRTIM_COMMON_ADC3R_AD1TEPER     (0x1U<<31)

// ADC4R Configuration

