Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_hrtim_common.h
#define HRTIM_COMMON_ADC4R_AD2MC1       (0x1U<<0)
#define HRTIM_COMMON_ADC4R_AD2MC2       (0x1U<<1)
#define HRTIM_COMMON_ADC4R_AD2MC3       (0x1U<<2)
#define HRTIM_COMMON_ADC4R_AD2MC4       (0x1U<<3)
#define HRTIM_COMMON_ADC4R_AD2MPER      (0x1U<<4)
#define HRTIM_COMMON_ADC4R_AD2EEV6      (0x1U<<5)
#define HRTIM_COMMON_ADC4R_AD2EEV7      (0x1U<<6)
#define HRTIM_COMMON_ADC4R_AD2EEV8      (0x1U<<7)
#define HRTIM_COMMON_ADC4R_AD2EEV9      (0x1U<<8)
#define HRTIM_COMMON_ADC4R_AD2EEV10     (0x1U<<9)
#define HRTIM_COMMON_ADC4R_AD2TAC2      (0x1U<<10)
#define HRTIM_COMMON_ADC4R_AD2TAC3      (0x1U<<11)
#define HRTIM_COMMON_ADC4R_AD2TAC4      (0x1U<<12)
#define HRTIM_COMMON_ADC4R_AD2TAPER     (0x1U<<13)
#define HRTIM_COMMON_ADC4R_AD2TBC2      (0x1U<<14)
#define HRTIM_COMMON_ADC4R_AD2TBC3      (0x1U<<15)
#define HRTIM_COMMON_ADC4R_AD2TBC4      (0x1U<<16)
#define HRTIM_COMMON_ADC4R_AD2TBPER     (0x1U<<17)
#define HRTIM_COMMON_ADC4R_AD2TCC2      (0x1U<<18)
#define HRTIM_COMMON_ADC4R_AD2TCC3      (0x1U<<19)
#define HRTIM_COMMON_ADC4R_AD2TCC4      (0x1U<<20)
#define HRTIM_COMMON_ADC4R_AD2TCPER     (0x1U<<21)
#define HRTIM_COMMON_ADC4R_AD2TCRST     (0x1U<<22)
#define HRTIM_COMMON_ADC4R_AD2TDC2      (0x1U<<23)
#define HRTIM_COMMON_ADC4R_AD2TDC3      (0x1U<<24)
#define HRTIM_COMMON_ADC4R_AD2TDC4      (0x1U<<25)
#define HRTIM_COMMON_ADC4R_AD2TDPER     (0x1U<<26)
#define HRTIM_COMMON_ADC4R_AD2TDRST     (0x1U<<27)
#define HRTIM_COMMON_ADC4R_AD2TEC2      (0x1U<<28)
#define HRTIM_COMMON_ADC4R_AD2TEC3      (0x1U<<29)
#define HRTIM_COMMON_ADC4R_AD2TEC4      (0x1U<<30)
#define HRTIM_COMMON_ADC4R_AD2TERST     (0x1U<<31)

// DLLCR Configuration

#define HRTIM_COMMON_DLLCR_CAL          (0x1U<<0)
#define HRTIM_COMMON_DLLCR_CALEN        (0x1U<<1)
#define HRTIM_COMMON_DLLCR_CALRTE       (0x3U<<2)
#define HRTIM_COMMON_DLLCR_CALRTE_0     (0x1U<<2)

// FLTINR1 Configuration

#define HRTIM_COMMON_FLTINR1_FLT1E      (0x1U<<0)
#define HRTIM_COMMON_FLTINR1_FLT1P      (0x1U<<1)
#define HRTIM_COMMON_FLTINR1_FLT1SRC    (0x1U<<2)
#define HRTIM_COMMON_FLTINR1_FLT1F      (0xFU<<3)
#define HRTIM_COMMON_FLTINR1_FLT1F_0    (0x1U<<3)
#define HRTIM_COMMON_FLTINR1_FLT1LCK    (0x1U<<7)
#define HRTIM_COMMON_FLTINR1_FLT2E      (0x1U<<8)
#define HRTIM_COMMON_FLTINR1_FLT2P      (0x1U<<9)
#define HRTIM_COMMON_FLTINR1_FLT2SRC    (0x1U<<10)
#define HRTIM_COMMON_FLTINR1_FLT2F      (0xFU<<11)
#define HRTIM_COMMON_FLTINR1_FLT2F_0    (0x1U<<11)
#define HRTIM_COMMON_FLTINR1_FLT2LCK    (0x1U<<15)
#define HRTIM_COMMON_FLTINR1_FLT3E      (0x1U<<16)
#define HRTIM_COMMON_FLTINR1_FLT3P      (0x1U<<17)
#define HRTIM_COMMON_FLTINR1_FLT3SRC    (0x1U<<18)
#define HRTIM_COMMON_FLTINR1_FLT3F      (0xFU<<19)
#define HRTIM_COMMON_FLTINR1_FLT3F_0    (0x1U<<19)
#define HRTIM_COMMON_FLTINR1_FLT3LCK    (0x1U<<23)
#define HRTIM_COMMON_FLTINR1_FLT4E      (0x1U<<24)
#define HRTIM_COMMON_FLTINR1_FLT4P      (0x1U<<25)
#define HRTIM_COMMON_FLTINR1_FLT4SRC    (0x1U<<26)
#define HRTIM_COMMON_FLTINR1_FLT4F      (0xFU<<27)
#define HRTIM_COMMON_FLTINR1_FLT4F_0    (0x1U<<27)
#define HRTIM_COMMON_FLTINR1_FLT4LCK    (0x1U<<31)

// FLTINR2 Configuration

#define HRTIM_COMMON_FLTINR2_FLT5E      (0x1U<<0)
#define HRTIM_COMMON_FLTINR2_FLT5P      (0x1U<<1)
#define HRTIM_COMMON_FLTINR2_FLT5SRC    (0x1U<<2)
#define HRTIM_COMMON_FLTINR2_FLT5F      (0xFU<<3)
#define HRTIM_COMMON_FLTINR2_FLT5F_0    (0x1U<<3)
#define HRTIM_COMMON_FLTINR2_FLT5LCK    (0x1U<<7)
#define HRTIM_COMMON_FLTINR2_FLTSD      (0x3U<<24)
#define HRTIM_COMMON_FLTINR2_FLTSD_0    (0x1U<<24)

// BDMUPDR Configuration

#define HRTIM_COMMON_BDMUPDR_MCR        (0x1U<<0)
#define HRTIM_COMMON_BDMUPDR_MICR       (0x1U<<1)
#define HRTIM_COMMON_BDMUPDR_MDIER      (0x1U<<2)
#define HRTIM_COMMON_BDMUPDR_MCNT       (0x1U<<3)
#define HRTIM_COMMON_BDMUPDR_MPER       (0x1U<<4)
#define HRTIM_COMMON_BDMUPDR_MREP       (0x1U<<5)
#define HRTIM_COMMON_BDMUPDR_MCMP1      (0x1U<<6)
#define HRTIM_COMMON_BDMUPDR_MCMP2      (0x1U<<7)
#define HRTIM_COMMON_BDMUPDR_MCMP3      (0x1U<<8)
#define HRTIM_COMMON_BDMUPDR_MCMP4      (0x1U<<9)

// BDTXUPR Configuration

#define HRTIM_COMMON_BDTXUPR_TIMXCR     (0x1U<<0)
#define HRTIM_COMMON_BDTXUPR_TIMXICR    (0x1U<<1)
#define HRTIM_COMMON_BDTXUPR_TIMXDIER   (0x1U<<2)
#define HRTIM_COMMON_BDTXUPR_TIMXCNT    (0x1U<<3)
#define HRTIM_COMMON_BDTXUPR_TIMXPER    (0x1U<<4)
#define HRTIM_COMMON_BDTXUPR_TIMXREP    (0x1U<<5)
#define HRTIM_COMMON_BDTXUPR_TIMXCMP1   (0x1U<<6)
#define HRTIM_COMMON_BDTXUPR_TIMXCMP2   (0x1U<<7)
#define HRTIM_COMMON_BDTXUPR_TIMXCMP3   (0x1U<<8)
#define HRTIM_COMMON_BDTXUPR_TIMXCMP4   (0x1U<<9)
#define HRTIM_COMMON_BDTXUPR_TIMX_DTXR  (0x1U<<10)
#define HRTIM_COMMON_BDTXUPR_TIMXSET1R  (0x1U<<11)
#define HRTIM_COMMON_BDTXUPR_TIMXRST1R  (0x1U<<12)
#define HRTIM_COMMON_BDTXUPR_TIMXSET2R  (0x1U<<13)
#define HRTIM_COMMON_BDTXUPR_TIMXRST2R  (0x1U<<14)
#define HRTIM_COMMON_BDTXUPR_TIMXEEFR1  (0x1U<<15)
#define HRTIM_COMMON_BDTXUPR_TIMXEEFR2  (0x1U<<16)
#define HRTIM_COMMON_BDTXUPR_TIMXRSTR   (0x1U<<17)
#define HRTIM_COMMON_BDTXUPR_TIMXCHPR   (0x1U<<18)
#define HRTIM_COMMON_BDTXUPR_TIMXOUTR   (0x1U<<19)
#define HRTIM_COMMON_BDTXUPR_TIMXFLTR   (0x1U<<20)

// BDMADR Configuration

#define HRTIM_COMMON_BDMADR_BDMADR      (0xFFFFFFFFU<<0)
#define HRTIM_COMMON_BDMADR_BDMADR_0    (0x1U<<0)
